core/src/test/resources/soap-sample/soapRequest-Bonn.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cs="https://predic8.de/city-service">
    <s:Body>
        <cs:getCityDetails>
            <city>Bonn</city>
        </cs:getCityDetails>
    </s:Body>
</s:Envelope>